// import '../css/AdminPrivacyPolicy.css'
import 'bootstrap-icons/font/bootstrap-icons.css';




function AdminPrivacyPolicy() {

    const goback = () => {
        window.location.href = "/easycheck/settingsadmin";
    };

    return (

        <div
            style={{
                background: 'linear-gradient(to bottom, #3C467B, #6E80E1)',
                minHeight: '100vh',
                width: '80vw',
            }}>

            <div className="position-relative py-5">

                <i
                    className="bi bi-chevron-left position-absolute"
                    onClick={goback}
                    style={{
                        color: '#FFFF',
                        fontSize: '30px',
                        left: '20px',
                        top: '50%',
                        transform: 'translateY(-50%)',
                    }}
                ></i>

                <h1 className="text-white text-center m-0">Privacy Policy</h1>
                
            </div>



            <div style={{
                color: '#FFFF',

            }}>

                <div className='p-5'>

                    <h2 class="light-text">บทนำ</h2>

                    <br />


                    <div className='p-3'>
                        <p>
                            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;หน้านี้จัดทำขึ้นเพื่อแจ้งผู้ดูแลระบบ (Administrator) ว่าข้อมูลทั้งหมดที่อยู่ในระบบนี้ถือเป็น “ข้อมูลส่วนบุคคล” ของผู้ใช้ และอยู่ภายใต้นโยบายความเป็นส่วนตัวของบริษัทการเข้าถึงข้อมูลต้องเป็นไปตามสิทธิ์ที่ได้รับมอบหมายเท่านั้น
                        </p>
                    </div>

                    <hr style={{ height: '1px', width: '100%', backgroundColor: '#000', border: 'none' }} />


                    <p className='p-3'>
                        การดาวน์โหลดหรือส่งออกข้อมูลจากระบบนี้ต้องดำเนินการ
                        ด้วยความระมัดระวัง และมีวัตถุประสงค์เพื่อการบริหารจัดการ ภายในองค์กรเท่านั้น ห้ามนำข้อมูลส่วนบุคคลไปใช้ เผยแพร่ หรือจัดเก็บในที่ซึ่งอาจทำให้เกิดความเสียหายแก่เจ้าของข้อมูล หรือกระทบต่อความปลอดภัยของระบบ
                    </p>


                    <p className='p-3'>
                        ทั้งนี้ ผู้ดูแลระบบทุกท่านมีหน้าที่รับผิดชอบ ในการรักษาความลับของข้อมูลดังกล่าว ไม่ว่าจะเป็นในรูปแบบไฟล์เอกสาร สเปรดชีต ฐานข้อมูล หรือสื่ออิเล็กทรอนิกส์อื่นๆโดยต้องปฏิบัติตามมาตรการรักษาความปลอดภัยของข้อมูล (Data Security Policy) ที่บริษัทกำหนดไว้หากมีความจำเป็นต้องส่งออกข้อมูลเพื่อการตรวจสอบ วิเคราะห์ หรือรายงานผล ควรทำผ่านช่องทางที่ปลอดภัย และเก็บรักษาไฟล์ข้อมูลภายใต้ระบบที่ได้รับอนุญาตเท่านั้น
                        บริษัทขอสงวนสิทธิ์ในการตรวจสอบการใช้งานระบบทั้งหมด เพื่อป้องกันการเข้าถึงข้อมูลโดยมิชอบ และเพื่อให้มั่นใจว่าข้อมูลส่วนบุคคลของผู้ใช้ทุกคนได้รับการคุ้มครองอย่างสูงสุดตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล (PDPA) และมาตรฐานความปลอดภัยขององค์กร
                        โปรดตรวจสอบให้แน่ใจว่าการส่งออกข้อมูลทุกครั้ง ได้รับการอนุมัติจากผู้มีอำนาจ และมีการบันทึกประวัติการดำเนินการ (Log) อย่างครบถ้วน เพื่อความโปร่งใสและสามารถตรวจสอบย้อนหลังได้ทุกกรณี
                    </p>

                    <br />

                    <h2 > ประเภทข้อมูลที่สามารถเข้าถึงได้ </h2>

                    <div className='p-4'>
                            <li> ข้อมูลส่วนตัวของพนักงาน (ชื่อ, เบอร์โทร, อีเมล) </li>
                            <li> ข้อมูลการเข้างาน (เวลา, GPS, รูปภาพ, สถานะ) </li>
                            <li> ประวัติการลา / การทำงาน </li>
                            <li> รายงานสรุปประจำวันหรือเดือน </li>
                            <li> Log การใช้งานระบบ </li>
                    </div>

                    <br />

                    <h2>วัตถุประสงค์</h2>

                    <div className='p-4'>
                            <li> เพื่อดูแล ตรวจสอบ และแก้ไขปัญหาในระบบ </li>
                            <li> เพื่อจัดทำรายงานให้ฝ่ายบุคคลหรือผู้บริหาร </li>
                            <li> เพื่อควบคุมการเข้าถึงและความปลอดภัยของข้อมูลในระบบ </li>
                    </div>

                    <br />

                    <h2>ข้อจำกัดและความรับผิดชอบ</h2>

                    <div className='p-4'>
                            <li> ห้ามเปิดเผยข้อมูลส่วนบุคคลให้ผู้อื่นโดยไม่ได้รับอนุญาต </li>
                            <li> ห้ามนำข้อมูลไปใช้เพื่อวัตถุประสงค์ส่วนตัว </li>
                            <li> ห้ามดาวน์โหลดหรือส่งต่อข้อมูลออกนอกระบบโดยไม่ได้รับอนุมัต </li>
                            <li> ต้องเก็บรักษาข้อมูลอย่างปลอดภัย และออกจากระบบเมื่อใช้งานเสร็จ </li>
                            <li> ต้องรายงานทันทีหากพบการรั่วไหลของข้อมูล (Data Breach) </li>
                    </div>

                    <br />

                    <h2>Legal Compliance</h2>

                    <p className='p-2'>บริษัทให้ความสำคัญกับการคุ้มครองข้อมูลส่วนบุคคล ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล (PDPA)พ.ศ. 2562</p>
                    <p className='p-2'>ผู้ดูแลระบบต้องปฏิบัติตามกฎหมายนี้อย่างเคร่งครัด ในการจัดการข้อมูลภายในระบบ</p>

                    <br />

                    <h2>ช่องทางติดต่อ</h2>

                    <p className='p-2'>หากท่านพบการเข้าถึงข้อมูลที่ไม่เหมาะสมหรือสงสัยว่าข้อมูล
                        รั่วไหล โปรดติดต่อเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล (DPO)
                    </p>

                </div>



            </div>


        </div>


    )
}

export default AdminPrivacyPolicy;